package com.andrey7mel.testrx.presenter;

public interface Presenter {
// Presenter - в данном слое хранится вся логика приложения.
// Получаем Observable, подписываемся на него и передаем результат во view.

// Презентер знает что загрузить, как показать, что делать в случае ошибки и прочее.
// Т.е отделяет логику от представления. View в таком случае получается максимально «легкой».
// Наш презентер должен уметь обрабатывать нажатие кнопки поиска, инициализировать загрузку,
// отдавать данные и отписываться в случае остановки Activity.
    void onSearchButtonClick();

    void onStop();
}
